full_stack/app/controllers/blog_controller.rb

    def index
        @blog = Blog.all
---
SELECT "blogs".* FROM "blogs"

    def create
        @blog = Blog.create(blog_params)
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Construction"], ["content", "Industry"], ["created_at", "2021-03-17 22:16:36.960888"], ["updated_at", "2021-03-17 22:16:36.960888"]]

    def destroy
        @blog = Blog.find(params[:id])
        redirect_to @blog.destroy ? blogs_path : blog_path(@blog)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 6]]

    def update
        @blog = Blog.find(params[:id])
        @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "fixed "], ["content", "this"], ["updated_at", "2021-03-17 23:11:26.757288"], ["id", 8]]