blog_app/app/controllers/blog_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def index
    @blogs = BlogPost.all

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @blog = BlogPost.find(params[:id])

INSERT INTO "blog_posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdf"], ["content", "asdfasdf"], ["created_at", "2021-03-17 22:09:48.584726"], ["updated_at", "2021-03-17 22:09:48.584726"]]
---
  def create
    @blog_post = BlogPost.create(blog_post_params)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 1]]
---
  def destroy
    @blog = BlogPost.find(params[:id])
    if @blog.destroy

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @blog = BlogPost.find(params[:id])

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "blog_posts" SET "content" = $1, "updated_at" = $2 WHERE "blog_posts"."id" = $3  [["content", "llllll"], ["updated_at", "2021-03-17 22:46:14.028013"], ["id", 3]]
---
  def update
    @blog = BlogPost.find(params[:id])
    @blog.update(blog_post_params)